alice_in_wonderland = ( '"Would you tell me, please, which way I ought to go from here?"\n'
                        '"That depends a good deal on where you want to get to," said the Cat.\n'
                        '"I don\'t much care where ——" said Alice.\n'
                        '"Then it doesn\'t matter which way you go," said the Cat.\n'
                        '"—— so long as I get somewhere," Alice added as an explanation.\n'
                        '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."' )
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea = 436402
azov_sea = 37800
total = black_sea + azov_sea
print(f"Площа Чорного моря становить {black_sea} км2")
print(f"Площа Азовського моря становить {azov_sea} км2")
print(f"Разом Чорне та Азовське море займають {total} км2")


# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
werhaus_total = 375291
first_second_werhaus = 250449
second_third_werhouse = 222950
third = werhaus_total - first_second_werhaus
first = werhaus_total - second_third_werhouse
second = werhaus_total - first - third
print(f"Мережа супермаркетів має 3 склади, де всього розміщено {werhaus_total} товарів")
print(f"На першому складі - {first} товарів")
print(f"На другому складі - {second} товарів")
print(f"На третьому складі - {third} товарів")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
year_and_half = 18
month_payment = 1179
total_price = year_and_half * month_payment
print(f"Михайло платить щомісяця за компьютер по {month_payment} грн")
print(f"Загальна вартість компьютера становить - {total_price} грн")




# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
print(" Залишок від ділення 8019 : 8 = ",8019 % 8 )
print(" Залишок від ділення 9907 : 9 = ",9907 % 9)
print(" Залишок від ділення 2789 : 5 = ",2789 % 5)
print(" Залишок від ділення 7248 : 6 = ",7248 % 6)
print(" Залишок від ділення 7128 : 5 = ",7128 % 5)
print(" Залишок від ділення 19224 : 9 = ",19224 % 9)



# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
big_pizza = 4 * 274
medium_pizza = 2 * 218
juice = 4 * 35
cake = 1 * 350
water = 3 * 21

total = big_pizza + medium_pizza + juice + cake + water

print(f"Піца велика: {big_pizza} грн")
print(f"Піца середня: {medium_pizza} грн")
print(f"Сік: {juice} грн")
print(f"Торт: {cake} грн")
print(f"Вода: {water} грн")
print(f"Загальна вартість замовлення становить {total} грн.")




# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_photos = 232
album_pages = total_photos//8
print(f"Ігорю треба {album_pages} сторінок щоб вклеїти {total_photos} фотографії")


# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""

