# Порахувати та вивести(print) кількість букв в строці:
# Юзер щось вводить(input)
# Ваша задача надрукувати кількість кожного символу того що він ввів.
# Прикдад:
# Юзер вводить: My name is Emmy Santiago.
# Ви прінтаете щось накшталт:M = 1, y = 2, n = 2, ...(або в іншому форматі, це не принциповоб головне, що б чітко було зрозуміло скільки разів зустрічаеться кожна буква)
# Тобто кожну букву та скільки разів вона зустрічаеться

www = ("".join((input("Enter words - ")).split())).lower()
result = {}
if www.isalpha():
    for i in www:
        cou = www.count(i)
        result[i] = cou
print(result)

